#  Read and write CSV and XLS files

In [12]:
import pandas as pd
df = pd.read_csv('weather_data.csv') # importing csv files
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [13]:
df = pd.read_excel('weather_data.xlsx') # importing excel files
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

## To store data

In [15]:
df.to_csv('new_csv') # this will sote with index

In [16]:
df.to_csv('new_noIndex.csv', index=False )

In [18]:
df.to_excel('new.xlsx', sheet_name='weather_data')

## group by

In [19]:
df = pd.read_csv('weather_data_cities.csv')

In [20]:
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [23]:
g = df.groupby('event')
g

In [25]:
for event,event_df in g:
    print(event)
    print(event_df)

Cloudy
         day   city  temperature  windspeed   event
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy
Fog
        day    city  temperature  windspeed event
5  1/2/2017  mumbai           85         12   Fog
6  1/3/2017  mumbai           87         15   Fog
Rain
        day      city  temperature  windspeed event
0  1/1/2017  new york           32          6  Rain
7  1/4/2017    mumbai           92          5  Rain
Snow
        day      city  temperature  windspeed event
2  1/3/2017  new york           28         12  Snow
Sunny
        day      city  temperature  windspeed  event
1  1/2/2017  new york           36          7  Sunny
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny
8  1/1/2017     paris           45         20  Sunny

In [27]:
g.get_group('Rain')

        day      city  temperature  windspeed event
0  1/1/2017  new york           32          6  Rain
7  1/4/2017    mumbai           92          5  Rain

In [28]:
print(g.max())

             day      city  temperature  windspeed
event
Cloudy  1/4/2017     paris           54         13
Fog     1/3/2017    mumbai           87         15
Rain    1/4/2017  new york           92          6
Snow    1/3/2017  new york           28         12
Sunny   1/4/2017     paris           90         20

In [29]:
print(g.mean())

        temperature  windspeed
event
Cloudy    48.666667  10.333333
Fog       86.000000  13.500000
Rain      62.000000   5.500000
Snow      28.000000  12.000000
Sunny     51.000000   9.750000

In [30]:
print(g.describe())

       temperature                                                        \
             count       mean        std   min    25%   50%    75%   max
event
Cloudy         3.0  48.666667   6.110101  42.0  46.00  50.0  52.00  54.0
Fog            2.0  86.000000   1.414214  85.0  85.50  86.0  86.50  87.0
Rain           2.0  62.000000  42.426407  32.0  47.00  62.0  77.00  92.0
Snow           1.0  28.000000        NaN  28.0  28.00  28.0  28.00  28.0
Sunny          4.0  51.000000  26.495283  33.0  35.25  40.5  56.25  90.0

       windspeed
           count       mean       std   min    25%   50%    75%   max
event
Cloudy       3.0  10.333333  2.516611   8.0   9.00  10.0  11.50  13.0
Fog          2.0  13.500000  2.121320  12.0  12.75  13.5  14.25  15.0
Rain         2.0   5.500000  0.707107   5.0   5.25   5.5   5.75   6.0
Snow         1.0  12.000000       NaN  12.0  12.00  12.0  12.00  12.0
Sunny        4.0   9.750000  6.898067   5.0   6.50   7.0  10.25  20.0

# how to concatinate

In [31]:
import pandas as pd

In [33]:
India_weather = pd.DataFrame({
    'city':['Mumbai','Delhi','Banglore'],
    'Temperature':[32,45,30],
    'Humidity':[80,60,78]
})

India_weather

       city  Temperature  Humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78

In [34]:
us_weather = pd.DataFrame({
    'city':['new york','chicago','orlando'],
    'Temperature': [21,14,35],
    'Humidity':[68,65,75]
})
us_weather

       city  Temperature  Humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [35]:
df = pd.concat([India_weather, us_weather])
df

       city  Temperature  Humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [36]:
df = pd.concat([India_weather, us_weather], ignore_index = True)
df

       city  Temperature  Humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [38]:
df = pd.concat([India_weather, us_weather], axis = 1)
df

       city  Temperature  Humidity      city  Temperature  Humidity
0    Mumbai           32        80  new york           21        68
1     Delhi           45        60   chicago           14        65
2  Banglore           30        78   orlando           35        75

# Merging

In [39]:
temperature_df = pd.DataFrame({
    'city':['mumbai','delhi','banglore','hyderabad'],
    'temperature':[32,45,30,40]
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           30
3  hyderabad           40

In [41]:
humidity_df = pd.DataFrame({
    'city': ['delhi','mumbai','banglore'],
    'humidity':[68,65,75]
})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75

In [43]:
df = pd.merge(temperature_df,humidity_df, on='city', how = 'inner')
df

       city  temperature  humidity
0    mumbai           32        65
1     delhi           45        68
2  banglore           30        75

In [44]:
df = pd.merge(temperature_df,humidity_df, on='city', how = 'outer')
df

        city  temperature  humidity
0     mumbai           32      65.0
1      delhi           45      68.0
2   banglore           30      75.0
3  hyderabad           40       NaN

city           banglore
temperature          30
humidity             75
Name: 2, dtype: object

# Numerical Indexing

In [49]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45,1,2,3,4,5])

In [50]:
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

###### There r 2 methods to get a values
1) to get it by index ( say what is the value at index x )

2) to get it by row ( say what is the value at row y )

In [61]:
# Get by index ( this give index by index )
df.loc[46,0]

4

In [62]:
# get by row ( this give index by row no.)
df.iloc[3,0]

4